distribution/scripts/jmeter/requests/5K_buyStocks_secure.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-12490478291416-320042615"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">CuJdE1B2dUFd1dkLZSzQ5vj6MYg=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>c9UNG5zV3BeoKwXUP33NhPb5GK8sOIYrBbduBsnHbVBIKM3FVK8ACIv2CqxAE/qkHRX4FlNbdX9h
j06iw6x+YQAi1SLvyMRsoh/Z60Q0yoQgMkwyhYDqtuouJDBHhTCf6A9Hw+Pgd2zfG+v2b1ly1His
zSlSfWOIPGU+jTkww4k=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#id-12490478575530-1759238429"/></xenc:ReferenceList></xenc:EncryptedKey><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-12490451928284-900784003">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>u0Ff6JkXdMu9kyyP+V7gGkB9M9o=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-12490403004179-163867565">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>beXRQlxN4mZPuGwinTnbTi6uAVg=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
dfOz21lnCC8ZlEnCAR79GS64HMBYQ/I4A4Lgnt47aQeU/Qwgz3jyx1UtFqDNgB2/niF2SjMUoG1S
Nsu2TCA8xXPucRN6hI6mkltVXLoEK8mVEo4+sAhKxe8Id3INtMHCoghWUrInrKHF3CEQv3oFtC0o
/9878Gwg12ngmEceqR0=
</ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#id-12490477634070-524241809" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp wsu:Id="id-12490403004179-163867565" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2010-01-31T07:30:52.608Z</wsu:Created><wsu:Expires>2020-01-29T07:30:52.608Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-12490477634070-524241809">MIIDCjCCAfKgAwIBAgIQYDju2/6sm77InYfTq65x+DANBgkqhkiG9w0BAQUFADAwMQ4wDAYDVQQK
DAVPQVNJUzEeMBwGA1UEAwwVT0FTSVMgSW50ZXJvcCBUZXN0IENBMB4XDTA1MDMxOTAwMDAwMFoX
DTE4MDMxOTIzNTk1OVowQDEOMAwGA1UECgwFT0FTSVMxIDAeBgNVBAsMF09BU0lTIEludGVyb3Ag
VGVzdCBDZXJ0MQwwCgYDVQQDDANCb2IwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAMCquMva
4lFDrv3fXQnKK8CkSU7HvVZ0USyJtlL/yhmHH/FQXHyYY+fTcSyWYItWJYiTZ99PAbD+6EKBGbdf
uJNUJCGaTWc5ZDUISqM/SGtacYe/PD/4+g3swNPzTUQAIBLRY1pkr2cm3s5Ch/f+mYVNBR41HnBe
Ixybw25kkoM7AgMBAAGjgZMwgZAwCQYDVR0TBAIwADAzBgNVHR8ELDAqMCiiJoYkaHR0cDovL2lu
dGVyb3AuYmJ0ZXN0Lm5ldC9jcmwvY2EuY3JsMA4GA1UdDwEB/wQEAwIEsDAdBgNVHQ4EFgQUXeg5
5vRyK3ZhAEhEf+YT0z986L0wHwYDVR0jBBgwFoAUwJ0o/MHrNaEd1qqqoBwaTcJJDw8wDQYJKoZI
hvcNAQEFBQADggEBAIiVGv2lGLhRvmMAHSlY7rKLVkv+zEUtSyg08FBT8z/RepUbtUQShcIqwWse
mDU8JVtsucQLc+g6GCQXgkCkMiC8qhcLAt3BXzFmLxuCEAQeeFe8IATr4wACmEQE37TEqAuWEIan
PYIplbxYgwP0OBWBSjcRpKRAxjEzuwObYjbll6vKdFHYIweWhhWPrefquFp7TefTkF4D3rcctTfW
J76I5NrEVld+7PBnnJNpdDEuGsoaiJrwTW3Ixm40RXvG3fYS4hIAPeTCUk3RkYfUkqlaaLQnUrF2
hZSgiBNLPe8gGkYORccRIlZCGQDEpcWl1Uf9OHw6fC+3hkqolFd5CVI=</wsse:BinarySecurityToken></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="id-12490451928284-900784003" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="id-12490478575530-1759238429" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#id-12490478291416-320042615"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>aNM36jjvD/G5aLyc5P/YYxl3nASUOXPROr5cTg0YDWPmJjD9a6AYXKivCGTfpWNpOyRl0zeK8UOf
PaPL9QIC29+YMQqhKe2bGtiQpe4tD0mgs5Ug0T1Cc327S4l6N+hRI/8/w1vfCDB46Z17g9YJ1bn1
p1c8g8f33+62OebYdZ0YsW9fnkpF5dpdAEQhB6bCc/1ET1Yh8ZlQj1h3bcSIUPAFYAINaWKPrFwG
7zfaJo8I9lNzpzKAtSov7G+OTZfOQEZhoPDf3cEYuklYc/djN2lC1MIsRbE+/KGYC8Pbjd4iklrJ
Hnpivctt4Z+ueImw1YrxPxnL6iCI8diWJQXgAwTloCEPUh7IMsy6bo4rUrEi5k5ivHlp/PrWVeYW
RFchGrT0OruRJAsQVOm5HjCIcwVKHF7vqgYdUr9h1wmMCZt5p8vLkztlasIDFoJjUrShlL0Af3+j
4Pd6Zb/IAeyMAmfHhiCwpuJwBXlBsKmCXCDtGUSR9KhUeXmMIzCVrLE2YW+0FfFVs2+qqiO3pmca
8sj7eNxi8V8ZhoxsPjmcN15iDcgGC7gjvq4VmV8E7UcIMVF4yQEoOACKki6Arq4leSrNHpJ9r4he
DPNfZbx0kkyfwET/BURkdb/Q5ghJQY0qlZNTJi7A0cxOEpumbvQmCKDijsVrFIdshmQfVjGUEf2N
P9mlXQWGjs1P+etT8QS10OroUjyVrDby+UXUNvipAX9OEIRrr6MxnRACMI3EMi3jy+eJttprs3zF
Q+n4zWeJle2Z+i3yRUVLIrVc4aYsz/izULyZ9cwUpt+451uAfqb7Y6r/0pYS48+dxOouzfAtjTfR
SpFlGJvaBipDTT6eI1HgDiu2+TXD/ITy3blkjV4Pztapb4j4nymv+AFOzD83URIpFJdcTwA+FtC9
ejWomMapHSI4bj42sx0MG1hXxb02DFCT2NIBDzD/EstJCkqFbUy3B1rDFbmItSEFtq97wF8USiHl
FHLXmMYUX7sQVJjHrdyAwnKQN1m5zBJzDvucMJw6jnOY3IXKPlj3SEn3zlN988kZtYH0lHMzk1ZL
/PvejGd0uCIa8cB6c4gFhqlsdWyRHyEKPz3uHQ6Z0lLB5+XLENOLqva3l2VLAKbe3GQpmL2zioyg
febP5ptni0vlswW/+q7mohIDCtFQr9EaLh35bgunKQ4jSWx7JqTNoPgxqiaCoXNykUChN7/ijw58
EagWOKdiZC8VHmbv3PcUBLp3GTftjRW4E0eRvgniNVdoXVki6A6yMAa8MKMCdqOIKbY/4siVT6xL
kzZla74efXzw7Mk3hj0F7y4WpPW0ptqqdcr8Lhk5twnUomlHMBFdoxpHcIlh5nJX7RnFo4PaAAmE
6YAm/aEt0OuObezzt1NLgTpDYiU0i0ywXfiSnhP5YNuFdywgCgqjbfM0mlwPQ36Gw+QvvhObsmj/
X8CDFHQz09ahhVWDJn/gXMMY4aAqHJ5CJvz54ja4boVOdfzk8lJLXfGODy5j7rGoCto+E69Ygbyt
HDdyrPrWofHTTwu9DQ+f0IQeRTlWN9OJA0STiYIMsSrWhM+f3Mv0iDmSGUL50pscOExSmwzOv5hz
Zo/fv0dkuZy5fuxEzkkInn0LWl7jeaOfX1ClVNH4PZ9kDPZJXHdWf+rVI51EjAoRct9iOLzaxZG2
kFyIyGXEypyVBc29Lf9sNjDmiGaHJhMX61HVawNxAuVEhybhZkNPMWsuqUxlusjKwpIWF3d8wzLT
MuMNHWXc8ewo0pS6MxzG8mH9MYZQxOl/Cd/S6lWpUahHvN5MN18JvDAtNMA3PHWAJv9/pUDn7t2q
DV2qj/Quc25hCp9i0FDTzXvg4w2awr960NlVFPnAl1S6oGEcJOyGYATj0I8h6JeIBHMQcQxhlD1u
ZMGEgrmbSDh72eHzeUhgH4ZEv004jZkV7bRGOHWfCvV5XAIXjOpahBh+cJyLkdNHjeUFFLsJdI8q
A9RjOP4sMdt9ZWqBzUHmOqjdRyApyWrKthYA8kwxE9MSnkQ3JHn8RubezGjXkhITcyoxTrQlDvEJ
1LUJoZy1z3xQ8XHUK4fpJDTMbNleR8Zepv2DFWtJ8+zqX/ENeCIEW0R+acZ2R7NT2rpYWi42OVdJ
36IAjgu0ei7ex5pWe80GVzvcj9drMaAMD+POwp6SpWPnR1Y6lGN7ZzqIQpg1o3xKzi9S0sgUAtcK
KF5yEgVt8scy4VopySIMQYp0CJGlrhd+D05qtClNe2m7f93nSqsehS9w4j1IB7YkzvI1pb/k53q3
WRAnSbgDXWW9zVhm1wKGhvmwnE5tICnquQi4Ubc8MiScJYBtCq2Z2qE+q8Ygln4f5aTI6TCY59Cz
mRD4Lf9ME9uLu3DzVv8x5a6UoRdTta/0Gyk70TBDt5kGaU157QM4qmPBhUa2wymu00ph7g/zzj4F
Z9iTxyyM/xYCIrQi8wJi2pCPDgtVnCSjEAPMolva9RbSGgckcMiktk3wbLQnFDcYPX32S7lty+rG
KfFejQGoI+nUdll0U/331CoLlTN8hu6fZILfB01cDhdy6eFUjYuwilxkJnaK+MpAKK3vrJSO6yzZ
M/QNuPYUYQAllReBpAPuDmtaGapRYYMuzsGNn7fM1DJFfkyk1es8fNR5+OlUutsoPLTYuvucZDe1
HCg92cHknaROCtRnc6cZzq1O6goaXdJAr1kvdxGYvHtFt7a2dD0wF0gWQUAkFGgHHLB6vONUWX/t
V0KbwyhT98eoarjF82SCWT27z+/bUJ8Cw9VjgknfK+6TfTO99DzJtalvR0h489M9Q3ig8BKRdxtu
uPoieMgE+lgg2rwg0G+JjwOVWOYGu3gb95xaVshNasSW3GEXqTavlaS8KAle0G0Ge/OOjtJhBI3p
fDNHNJkmZCCHA6x8RY2DpjpZKZE8qAIlfQta9k0p8+lwRzpUiJrfqL9LtiF+oaBXJ/qU3BP+So9S
69v0BORQIE5zejLeC+YCzCyy+o1By5pyfpzJbmX93634LwOOj2P5tZOEToxYBlROinRwpCyYBdOI
XWLYu03H6iGCv4xqW0iOOYzzU3UPmQT1XDvzyFNr2pFzsZeX09fcdZaAxjClhgYqA8gzjp1Pf+YV
x9El36zYVr8WipMrW5BLETwIJAVLscftPuHJPHKOpTh0hO/oA0LHbousfH1IiTNfouqK8cU2ZwKp
Cn/tYDahpowfDdM+U9zdK00E4eJk8+Hn0IT4mzCsbdSSAQkTCTFn0MzWPWNvlhX3OTB2BFvUoxD4
U2Pkkn/fRAbGFoY6lYaIweD+qDT1jTjhJpBiq2wzW0Ob6WFeJ9e2lJNzF3p2PUImgYKmyjqkWBkT
Giyk9BQCmNVDHIGYlpnb92IvGlwcsr3E3InV+qO991Jh8+gKt5OfRJ3EsoOvetBk8pT2gToOK0Ra
C1BAPBDT7PR7w39qjQFRqKO0VnzLfJaKparedE0qyLOZQ9JoqoZ8v4QRUoQHJnuTMxvaP9n5um1a
Tjp06uh/3ik46fDfL/HGyilchjO/+Dw7tefMrdUB3lImPI4HwwK0dWvQM9ptdPaEhPNP8s3GutCC
V3ajWNoBpmOoQxsUM0PKnHQQg689E+bAZdnu8z5Y+z7hPst3hS9YJwCHyU/4b6WZMVhn5UAcK/PS
EAZwL0OspiAJNetSEbd68eK2D7iDNauRwChVzbPotJnHXdaLXdoDvmk4IFpqwQXKhFllFsnNsVlZ
MpOOj3qcClD2AfF12/TvsMn3MAQUXyfqY2vHDvkk7hVHEHWF77B1GhFPWSrUsxkOnGnCEKH4EkB+
tN6enZXzTdBywIzMZgudhvYeb948qguJrgV4eY2eb0+W8faAfPpkt9jubvpww+WNQ20VCUh1t5YB
W0pmnP9Z/OuIXnlRzK9Ak0ipcXy9rbeo+cwVMFRnETqlbd4FWafOocUBEaZAO4dS/vJsxHT5TEfF
hpdU8sfL4jbOTMNzJgDszainRu6kV7pht1pZkWRShiUbIgabfSJsEDezpKqzvl+/QhQH971mQCZK
Kj2yWnRlCQwgq7yW608CintLzcYveQ+m9fUIwEXOxkeujyiHPIDVoFu4JBqOmDksneHUglseN4PK
FuAtPOyP7jxPav9PDonTWbKuhiPGWiSVQ45HjPAb/m7h3U2RLKZ48Fbu4y+qfwPboIlS68c2M6ta
WphFAe+ZliIUN6GnK5J0x/1IRA72RFVi4Q0nJ/bDRdt5wWrCbPyBQAfsG6/nQ1gCnJPYm3/EapJz
FtYkeGCuvfUu8HOUxGqmxGU5kw5pzLsp9aGV0/aJUnFOmWRfJP6PCAaMbfFDJ9wJy+CFO/5xUYew
DgOoUajwbItzHoLHXVrbXZjsnu/X+vb058vUhhcf82L3QAPxlPL1Uq9y8ypC5L94718b00MlGgh0
bXXLbVSbpCQPoyPL/1Yx4aSQZaolsnKnyK/QKoIKwtUCUDOrZ0swreUhWWFCGIeqZQ5iGmrBBRk8
9tujUO3D0ZQBF4ZqNRlr58d9uIcRfqYT8+kn+4UOp8o9kL5sv+M+JY3CITob6CGqtRg48p8wlgAk
EebsQpWqL4sX2RH5UNLe7nXFdcxFyK3lyJV6yOdOQkd1/7nrddJ48bbix55zf2omc2ENtNZZ8iRq
TN13JOpkREeyMAKZqrx/AWDHhQgJoKALcuJ1FsDv+QMEk8T836urGFhMdG/NsFVniy+34kpww1X9
8t0V9+hAZH8pwMjm3r2F6XIyPtilNY9QAgfHxdADfqmvId4HN7scQmKqagIT6mNJdMvLCAcPo9CY
aOq0a17xh4wIR5VwfrjsqcYOnfg0nK0tvueAYaq1NLdq1oINHerAby7rEToXWNHC5a7G7ahTbNoD
j4NYU6LSb5dNMygQa2LwJ+d4/l1dOd9dwr0svqaO0N/rKAO1PuXmtyl9PE3xk2rtw8yb9zc6ERiB
rGNIPOTThUw4NYx2+aGFMaEP9iqlkEImzTqAfURw7S5UjBAY/W6JgNK7YHBhuyJUOK/hrbtB+pRk
kAhCpXaimqzi1atgD4I3hS9u6QU8X0u5u6tN/x0X0dDUH61+D7qgm/2vaZkYOidihJ0wVZsRpOD/
iHv/kbb51K+cKOeaKxs6jOcZSyuHtOtMHYBqKa++LNtGCf/DhOJcTNa5/fos8WQ4rKW+Jzve5Wby
aIaFPYmTdCoBAMnAw0NDWFalspZ9nRid8LNru5lr6iz+FJ67qxH6SlvlP3w08/2lhaU56nR43BZm
0Wu0cdFVBHuiAcmlM4D5VWLcI7eDwftHo2ABpawjreOka+3MHNsHxqJ7xmE29Mjh/STHPm2rXBuO
4ha15Tqc7bZz7sgeZ3AVz/eVs9Xfg0BDiDy25woi5jMDZzIPOwR43DKeOdh194XP6mk5NgLSkh9A
9VAlj/N7xIuLMID2sq2zBQxbKBkvGl4TRzBh5wvXDpW9SnAUrSO1I3XoadQ+OffkfW5ZxzGf6E8p
gk+zuRscdOeGXoVQl1GkrPeRNWQcU3nFTHW4Luo2//ScF9qDMN8gYNtL8DX/L618cux0tl7QBSyW
YWWxs4c8qEC5O4Brd4zEmEZhXXYNWaHm2VwUk2wd+eGgjPczfWpO9kO1ceHKK/5xqNU94oRPqEJa
hMVZ26E4EV5DLNt1qOEXe6p/++GLkJEYaou9gpH5ARpeBEus1FYverHHKFEZtgnY/Z8JJsZFgq3V
sRrU6WRUBeDV8BLa9cGocqlB0pXJZJhT3StbZxGEBwnH33DeezBLGz+1x+v7l1Kpv3XcmbebWytQ
c+JCsULWb9gnd8N9apYrjPvew8aUsz9U99/S313Jfa4HeCta0K8Dq3BL8VvUbXE0nytZDZiEEOFQ
IkEHaEC70P9/XqlEFoP8i74609r4+us7PcBzLe5wEfUlDhn/1cFwd6/We/MPTqNEhruFR9K6trT/
GUEA/hFyDVbQv2ysX/hixyh+cmV0kenhtd6h3cgR3EPUdQDdentV3B3tdS8mX8KVohIMreh3pxIn
JrJbWrU5/kzTUBCjg+2QuvurI+XE8oWBYghdTe/B5tB6Au7Rv9B1MmbK/GSdxD9QVxRzp3u7af80
FN39WgwbbqhawhZNaCUMnmF/bOR3gaG/XEsGUWf6w1olNrg3HlgjJqsAvDvUXKNAucbYJD1uvxnZ
EBHUAoUYOHzCEMKSAa6sW5+u3907l5sckJSGvIWLfAYVfM/xjZvH1DmZ3tQmU8wZR9L4w9ajflMR
2eIPq2yoXDihsKwWLdxLs6lX6wdpVb05WQKHJK3yeG2zMUZ1OH93TsH/5WbmuJE5+iNhRS+4CFy/
Yz2vDL/f/XSRAmSbUDvtjRo0BxPwi6KRO0uA7UjZV+l4vjcemj7WnlYb1kN4s3VCNg4m/w1gyN5J
oVIZsuwGkRF7YEIWQMnL3RGF1fKCD07JADdsiWDIiXsy6+gUpaevmgUWkhPQGDdAy8tMnf/APveh
FJbVBkGbsvPyI2RN38fD49Ri8CKQcef43EDnMYk4ashHfxG1SeBUZkVnuqY5OSkzsE/VbhgQja+6
OknljCT9cWKW8gfPjzsTN2lxjCPd+UMHvxZSMcpQ5paaajUvrEIPkeV6tMY4+tX3AxFAMEWQDw9e
rTBkOJdM5a2g2LhQLlZcQbo+rYl1cETTs/+cPikNIGxQMM5j6rhGZqWO3k55hyVSIQLc7JunGwnY
QGZCNWExV9k=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>
